----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 32, 32]             640
              Tanh-2           [-1, 64, 32, 32]               0
            Conv2d-3          [-1, 128, 32, 32]          73,856
              Tanh-4          [-1, 128, 32, 32]               0
            Conv2d-5          [-1, 128, 32, 32]         147,584
              Tanh-6          [-1, 128, 32, 32]               0
   DeformConvBlock-7          [-1, 128, 32, 32]               0
            Conv2d-8          [-1, 128, 32, 32]         147,584
              Tanh-9          [-1, 128, 32, 32]               0
           Conv2d-10          [-1, 128, 32, 32]         147,584
             Tanh-11          [-1, 128, 32, 32]               0
  DeformConvBlock-12          [-1, 128, 32, 32]               0
           Conv2d-13          [-1, 128, 32, 32]           1,280
           Conv2d-14          [-1, 128, 32, 32]          16,512
             Tanh-15          [-1, 128, 32, 32]               0
   DepthConvBlock-16          [-1, 128, 32, 32]               0
   PixelUnshuffle-17           [-1, 2048, 8, 8]               0
           Conv2d-18            [-1, 128, 8, 8]       2,359,424
             Tanh-19            [-1, 128, 8, 8]               0
           Conv2d-20            [-1, 128, 8, 8]         147,584
             Tanh-21            [-1, 128, 8, 8]               0
        ConvBlock-22            [-1, 128, 8, 8]               0
           Conv2d-23           [-1, 2048, 8, 8]       2,361,344
             Tanh-24           [-1, 2048, 8, 8]               0
           Conv2d-25           [-1, 2048, 8, 8]      37,750,784
             Tanh-26           [-1, 2048, 8, 8]               0
        ConvBlock-27           [-1, 2048, 8, 8]               0
     PixelShuffle-28          [-1, 128, 32, 32]               0
           Conv2d-29            [-1, 1, 32, 32]             129
          Sigmoid-30            [-1, 1, 32, 32]               0
           Conv2d-31           [-1, 64, 32, 32]         184,960
             Tanh-32           [-1, 64, 32, 32]               0
           Conv2d-33            [-1, 1, 32, 32]              65
          Sigmoid-34            [-1, 1, 32, 32]               0
         Upsample-35          [-1, 1, 128, 128]               0
================================================================
Total params: 43,339,330
Trainable params: 43,339,330
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 23.47
Params size (MB): 165.33
Estimated Total Size (MB): 188.80
----------------------------------------------------------------